<template>
  <!-- Основная круглая кнопка -->
  <div class="floating-btn" @click="toggleMenu">
    <i class="phone"><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12 5V12M12 12V19M12 12H19M12 12H5" stroke="#222222" stroke-width="1.5" stroke-linecap="round"/>
</svg>
</i>
  </div>

  <!-- Скрытое меню с двумя круглыми ссылками -->
  <div v-if="isMenuVisible" class="floating-btn-menu">
    <!-- Ссылка для WhatsApp -->
    <a 
      class="floating-btn-item whatsapp-btn" 
      href="https://wa.me/+1234567890" 
      target="_blank" 
      aria-label="Написать в WhatsApp"
    >
      <i class="fa fa-phone"><svg role="presentation" width="50" height="50" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M25 50a25 25 0 100-50 25 25 0 000 50z" fill="#fff"></path><path d="M26.1 12a12.1 12.1 0 00-10.25 18.53l.29.46-1.22 4.46 4.57-1.2.45.27a12.1 12.1 0 106.16-22.51V12zm6.79 17.22c-.3.85-1.72 1.62-2.41 1.72-.62.1-1.4.14-2.25-.14-.7-.22-1.37-.47-2.03-.77-3.59-1.57-5.93-5.24-6.1-5.48-.19-.24-1.47-1.97-1.47-3.76 0-1.79.93-2.67 1.25-3.03.33-.37.72-.46.96-.46.23 0 .47 0 .68.02.22 0 .52-.09.8.62l1.1 2.7c.1.18.16.4.04.64s-.18.39-.36.6c-.18.21-.38.47-.54.64-.18.18-.36.38-.15.74.2.36.92 1.55 1.98 2.52 1.37 1.23 2.52 1.62 2.88 1.8.35.18.56.15.77-.1.2-.23.9-1.05 1.13-1.42.24-.36.48-.3.8-.18.33.12 2.09 1 2.44 1.18.36.19.6.28.69.43.09.15.09.88-.21 1.73z" fill="#27D061"></path><path d="M25 0a25 25 0 100 50 25 25 0 000-50zm1.03 38.37c-2.42 0-4.8-.6-6.9-1.76l-7.67 2 2.05-7.45a14.3 14.3 0 01-1.93-7.2c0-7.92 6.49-14.38 14.45-14.38a14.4 14.4 0 110 28.79z" fill="#27D061"></path></svg></i>
    </a>
    
    <!-- Ссылка для вызова -->
    <a 
      class="floating-btn-item phone-btn" 
      href="tel:+1234567890" 
      target="_blank" 
      aria-label="Позвонить"
    >
      <i class="fa fa-whatsapp"><svg class="t-sociallinks__svg" role="presentation" width="50px" height="50px" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg"> <path fill-rule="evenodd" clip-rule="evenodd" d="M50 100C77.6142 100 100 77.6142 100 50C100 22.3858 77.6142 0 50 0C22.3858 0 0 22.3858 0 50C0 77.6142 22.3858 100 50 100ZM50.0089 29H51.618C56.4915 29.0061 61.1633 30.9461 64.6073 34.3938C68.0512 37.8415 69.9856 42.5151 69.9856 47.3879V48.9968C69.9338 49.5699 69.6689 50.1027 69.2433 50.49C68.8177 50.8772 68.2623 51.0908 67.6868 51.0884H67.5029C66.8966 51.0358 66.3359 50.745 65.9437 50.2796C65.5516 49.8143 65.36 49.2124 65.4109 48.6061V47.3879C65.4109 43.7303 63.9578 40.2225 61.3711 37.6362C58.7844 35.0499 55.2761 33.597 51.618 33.597H50.3997C49.79 33.6488 49.1847 33.4563 48.7169 33.0619C48.2492 32.6675 47.9573 32.1035 47.9054 31.4939C47.8536 30.8843 48.0461 30.279 48.4406 29.8114C48.835 29.3437 49.3992 29.0518 50.0089 29ZM56.889 49.0132C56.4579 48.5821 56.2157 47.9975 56.2157 47.3879C56.2157 46.1687 55.7313 44.9994 54.869 44.1373C54.0068 43.2752 52.8374 42.7909 51.618 42.7909C51.0083 42.7909 50.4236 42.5488 49.9925 42.1177C49.5614 41.6867 49.3192 41.102 49.3192 40.4924C49.3192 39.8828 49.5614 39.2982 49.9925 38.8672C50.4236 38.4361 51.0083 38.1939 51.618 38.1939C54.0568 38.1939 56.3956 39.1626 58.1201 40.8868C59.8445 42.611 60.8133 44.9495 60.8133 47.3879C60.8133 47.9975 60.5711 48.5821 60.14 49.0132C59.7089 49.4442 59.1242 49.6864 58.5145 49.6864C57.9048 49.6864 57.3201 49.4442 56.889 49.0132ZM66.4011 69.0663L66.401 69.0846C66.3999 69.5725 66.2967 70.0547 66.0981 70.5003C65.8998 70.9451 65.611 71.3435 65.2499 71.67C64.8674 72.0182 64.4123 72.2771 63.9176 72.428C63.4516 72.5702 62.9613 72.6132 62.4782 72.5546C58.2475 72.53 53.4102 70.5344 49.1802 68.1761C44.8871 65.7827 41.0444 62.915 38.8019 60.9903L38.7681 60.9613L38.7367 60.9299C32.3303 54.5198 28.2175 46.1735 27.0362 37.186C26.9623 36.6765 27.0018 36.157 27.1519 35.6645C27.3027 35.1695 27.5615 34.7142 27.9094 34.3314C28.2397 33.9658 28.6436 33.6742 29.0944 33.4757C29.5447 33.2775 30.0316 33.1766 30.5234 33.1796H37.4967C38.299 33.1636 39.0826 33.4244 39.7156 33.9184C40.3527 34.4156 40.7979 35.1184 40.9754 35.9071L41.0038 36.0335V36.1631C41.0038 36.4901 41.0787 36.795 41.1847 37.2268C41.2275 37.4012 41.2755 37.5965 41.3256 37.8221L41.326 37.8238C41.583 38.9896 41.925 40.1351 42.3491 41.251L42.7322 42.259L38.4899 44.26L38.4846 44.2625C38.204 44.3914 37.986 44.6263 37.8784 44.9157L37.8716 44.934L37.8642 44.952C37.7476 45.236 37.7476 45.5545 37.8642 45.8385L37.9144 45.9608L37.9359 46.0912C38.0802 46.9648 38.5603 48.0981 39.4062 49.4169C40.243 50.7215 41.3964 52.1437 42.808 53.5872C45.6206 56.4634 49.3981 59.3625 53.5798 61.5387C53.8533 61.6395 54.1552 61.6343 54.4257 61.5231L54.4437 61.5157L54.462 61.5089C54.7501 61.4016 54.9842 61.1848 55.1133 60.9057L55.1148 60.9023L57.0232 56.6591L58.0397 57.03C59.1934 57.4509 60.3737 57.7947 61.5729 58.0592L61.5785 58.0605L61.5841 58.0618C62.152 58.1929 62.7727 58.3042 63.3802 58.3942L63.4231 58.4006L63.4654 58.4101C64.2537 58.5877 64.956 59.0332 65.453 59.6706C65.9429 60.2991 66.2033 61.0758 66.1916 61.8721L66.4011 69.0663Z" fill="#000"></path> </svg></i>
    </a>
  </div>
</template>

<script setup>
// Стейт для управления видимостью меню
import { ref } from 'vue';

const isMenuVisible = ref(false);

// Переключение видимости меню
const toggleMenu = () => {
  isMenuVisible.value = !isMenuVisible.value;
};
</script>

<style lang="scss" scoped>

body._lock .floating-btn {
  display: none;
}
/* Основная кнопка, которая запускает меню */
.floating-btn {
  position: fixed;
  bottom: 20px;
  right: 30px;
  background-color: #82dbf7;
  color: white;
  border-radius: 50%;
  padding: 2rem;
  font-size: 24px;
  cursor: pointer;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.2);
  z-index: 1000;
  transition: transform 0.3s ease; /* Для анимации перехода */
  &>i>svg {
    width: 3rem;
    height: 3rem;
  }
}


.floating-btn-menu {
  position: fixed;
  bottom: 100px; /* Чуть выше кнопки */
  right: 40px;
  display: flex;
  flex-direction: column;
  gap: 10px;
  z-index: 999; /* Меньший z-index, чем у основной кнопки */
}

/* Стили для каждой кнопки */
.floating-btn-item {
  background-color: #25d366; /* Зеленый для WhatsApp */
  color: white;
  border-radius: 50%;
  cursor: pointer;
  text-align: center;
  display: flex;
  justify-content: center;
  align-items: center;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.2);
  transition: transform 0.3s ease, opacity 0.3s ease;
}

@media (max-width:479.98px) {
  .floating-btn {
  bottom: 15px;
  right: 15px;
  padding: 1.5rem;
  &>i>svg {
    width: 3rem;
    height: 3rem;
  }
}

.floating-btn-menu {
  bottom: 90px; /* Чуть выше кнопки */
  right: 20px;
}
}

.floating-btn-item.phone-btn {
  background-color: #fff; /* Синий для телефона */
}

.floating-btn-item.whatsapp-btn {
  background-color: #25d366; /* Зеленый для WhatsApp */
  position: relative;
  z-index: -1; /* Ставим кнопку WhatsApp за кнопку телефона */
  /* Начальная позиция кнопки WhatsApp: скрыта за кнопкой для звонка */
  transform: translateY(30px) scale(0); 
  opacity: 0;
}

/* Анимация для появления кнопок */
.floating-btn-menu a {
  opacity: 0;
  transform: scale(0) translateY(20px); /* Начальная позиция (кнопки скрыты и сжаты) */
}

/* Анимация появления кнопки WhatsApp с эффектом выдвижения */
.floating-btn-menu a:nth-child(1) {
  animation: slideInFromBehind 0.4s forwards 0.3s; /* Анимация для WhatsApp */
}

/* Анимация появления кнопки для звонка */
.floating-btn-menu a:nth-child(2) {
  animation: slideInSecond 0.3s forwards 0.2s; /* Задержка для первой кнопки */
}

/* Анимация выдвижения кнопки WhatsApp */
@keyframes slideInFromBehind {
  0% {
    opacity: 0;
    transform: translateY(30px) scale(0); /* Начальная скрытая позиция */
  }
  100% {
    opacity: 1;
    transform: translateY(0) scale(1); /* Окончательная позиция */
  }
}

/* Анимация кнопки звонка */
@keyframes slideInSecond {
  to {
    opacity: 1;
    transform: scale(1) translateY(0); /* Восстановление нормального размера и положения */
  }
}
</style>
