export const questions = [
  {
    name: "Условия бесплатного замера",
    content: [
      {
        type: "list",
        items: [
          "Заключение договора с монтажом",
          "Предварительная оплаты 40% от стоимости заказа",
          "Площадь остекления более 20 м2",
          "Нахождение объекта до 100 км от МКАД.",
          "(При нахождение объекта далее 100 км от МКАД, цена оговаривается с менеджером)",
        ],
      },
      // {
      //   type: "highlighted-text",
      //   text: [
      //     "При несоблюдении данных условий выезд замерщика оплачивается отдельно",
      //     "\n",
      //     "Пример дополнительной строки с отступом."
      //   ],
      // },
      // {
      //   type: "highlighted-text",
      //   text: "Еще один **жирный текст**.",
      // },          
      {
        type: "highlighted-text",
        text: [
          "\n+", // Отступ сверху
          "При несоблюдении данных условий выезд замерщика оплачивается отдельно",
          "\n",
        ],
      },
      {
        type: "highlighted-text",
        text: [
          "При удаленности от МКАД на 0-75 км - 2500 руб.",
        ],
      },
      {
        type: "highlighted-text",
        text: [
          "При удаленности от МКАД на 75-100 км - 3000 руб.",
        ],
      },
      {
        type: "text",
        text: [
          "\n+", // Отступ сверху
          "Замер специалистом нашей компании осуществляется в течение 1-2 дней, после поступления заявки. В заранее обговоренное время, наш специалист приедет на Ваш объект для осуществления всех необходимых замеров и демонстрации вариантов окантовки и фурнитуры для мягких окон.",
        ],
      },
      // {
      //   type: "image",
      //   src: "https://optim.tildacdn.com/tild6662-6230-4863-b638-323864383735/-/resize/560x280/-/format/webp/12.jpg",
      //   alt: "Первая картинка",
      //   description: "Описание первой картинки.",
      // },
      // {
      //   type: "text",
      //   text: [
      //     "Текст перед отступами.",
      //     "\n+", // Отступ сверху
      //     "Текст после отступа сверху.",
      //     "\n-", // Отступ снизу
      //     "Текст после отступа снизу."
      //   ],
      // },
      // {
      //   type: "image",
      //   src: "https://optim.tildacdn.com/tild3737-3032-4234-b233-646164643562/-/resize/560x430/-/format/webp/10.jpg",
      //   alt: "Вторая картинка",
      //   description: "Описание второй картинки, которая идет после большого текста.",
      // },
    ],
  },
  {
    name: "Условия бесплатного замера",
    content: [
      {
        type: "list",
        items: [
          "Заключение договора с монтажом",
          "Предварительная оплаты 40% от стоимости заказа",
          "Площадь остекления более 20 м2",
          "Нахождение объекта до 100 км от МКАД.",
          "(При нахождение объекта далее 100 км от МКАД, цена оговаривается с менеджером)",
        ],
      },
      // {
      //   type: "highlighted-text",
      //   text: [
      //     "При несоблюдении данных условий выезд замерщика оплачивается отдельно",
      //     "\n",
      //     "Пример дополнительной строки с отступом."
      //   ],
      // },
      // {
      //   type: "highlighted-text",
      //   text: "Еще один **жирный текст**.",
      // },          
      {
        type: "highlighted-text",
        text: [
          "\n+", // Отступ сверху
          "При несоблюдении данных условий выезд замерщика оплачивается отдельно",
          "\n",
        ],
      },
      {
        type: "highlighted-text",
        text: [
          "При удаленности от МКАД на 0-75 км - 2500 руб.",
        ],
      },
      {
        type: "highlighted-text",
        text: [
          "При удаленности от МКАД на 75-100 км - 3000 руб.",
        ],
      },
      {
        type: "text",
        text: [
          "\n+", // Отступ сверху
          "Замер специалистом нашей компании осуществляется в течение 1-2 дней, после поступления заявки. В заранее обговоренное время, наш специалист приедет на Ваш объект для осуществления всех необходимых замеров и демонстрации вариантов окантовки и фурнитуры для мягких окон.",
        ],
      },
      // {
      //   type: "image",
      //   src: "https://optim.tildacdn.com/tild6662-6230-4863-b638-323864383735/-/resize/560x280/-/format/webp/12.jpg",
      //   alt: "Первая картинка",
      //   description: "Описание первой картинки.",
      // },
      // {
      //   type: "text",
      //   text: [
      //     "Текст перед отступами.",
      //     "\n+", // Отступ сверху
      //     "Текст после отступа сверху.",
      //     "\n-", // Отступ снизу
      //     "Текст после отступа снизу."
      //   ],
      // },
      // {
      //   type: "image",
      //   src: "https://optim.tildacdn.com/tild3737-3032-4234-b233-646164643562/-/resize/560x430/-/format/webp/10.jpg",
      //   alt: "Вторая картинка",
      //   description: "Описание второй картинки, которая идет после большого текста.",
      // },
    ],
  },
];
